
&НаСервере
Процедура ОКНаСервере()
	Выборка = Справочники.Номенклатура.ВыбратьИерархически(); 
	Пока Выборка.Следующий() Цикл 
		Если Выборка.ЭтоГруппа Тогда 
				
			//Сообщить("Група: " + Выборка.Наименование + "код: " + Выборка.Код);
			Иначе Если не Выборка.ЭтоГруппа Тогда
				Сообщить("Товар: " + Выборка.Наименование + "  Код: " + Выборка.Код + "/ група:" + Выборка.Родитель.Код);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ОКНаСервере();
КонецПроцедуры
