
&НаСервереБезКонтекста
Процедура окНаСервере()
	// Вставить содержимое обработчика.
	
	
	ДокУслуг = Документы.ОказаниеУслуги;
	ВыборкаДокументов = ДокУслуг.Выбрать(НачалоГода(ТекущаяДата()), КонецГода(ТекущаяДата())); 
	Пока ВыборкаДокументов.Следующий() Цикл 
		Сообщить("Привет мир!");

	// Действия с документом - элементом выборки, 
	// его значение содержится в переменной ВыборкаДокументов 
	Сообщить(ВыборкаДокументов);
КонецЦикла 

	
КонецПроцедуры

&НаКлиенте
Процедура ок(Команда)
	окНаСервере();
КонецПроцедуры
