
&НаСервере
Процедура ОкНаСервере()
	ВыборкаДокументов = Документы.ОказаниеУслуги.Выбрать(ПериодН, ПериодК); 
	ИтоговаяСумма = 0;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура", Услуга);
	Пока  ВыборкаДокументов.Следующий() Цикл 

		Если ВыборкаДокументов.Клиент = Клиент Тогда 
			Для каждого ТекущаяСтрока Из ВыборкаДокументов.ПереченьНоменклатуры Цикл 
				Если ТекущаяСтрока.Номенклатура = Услуга Тогда    //ВыборкаДокументов.ПереченьНоменклатуры.Найти(Услуга,"Номенклатура")
					
					Сообщить(ВыборкаДокументов.Номер + "  Сумма:" + ТекущаяСтрока.Сумма + " грн.");  //ДокументОбъект.ПереченьНоменклатуры.ИтогСумма
					ИтоговаяСумма = ИтоговаяСумма + ТекущаяСтрока.Сумма;
				КонецЕсли;
			КонецЦикла;
			
			//ПараметрыОтбора.Вставить("Номенклатура", Услуга);
			//НайденныеСтроки = ВыборкаДокументов.ПереченьНоменклатуры.НайтиСтроки(ПараметрыОтбора);
			//
			//Сообщить(ВыборкаДокументов.Номер + "  Сумма:" + НайденныеСтроки.Получить("Сумма") + " грн.");
			//ИтоговаяСумма = ИтоговаяСумма + НайденныеСтроки.Получить("Сумма");
			
		КонецЕсли;
		
	КонецЦикла;
	Сообщить("Итог: " + ИтоговаяСумма);
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	ОкНаСервере();
КонецПроцедуры
