
&НаСервере
Функция ПолучитьСписокМаршрутов()
	возврат Маршруты.Выгрузить().ВыгрузитьКолонку("Маршрут"); 
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаФормирования =  текущаяДата();
	ДобавитьВсехМаршруты();
КонецПроцедуры

//&НаСервере
//Функция МаршрутПриИзмененииНаСервере(МаршрутТекСтрока) 
//	маршруты[МаршрутТекСтрока].Агент = маршруты[МаршрутТекСтрока].Маршрут.Агент;
//КонецФункции	
//&НаКлиенте
//Процедура МаршрутыМаршрутПриИзменении(Элемент)
//	МаршрутПриИзмененииНаСервере(ЭтаФорма.Элементы.Маршруты.ТекущаяСтрока)
//КонецПроцедуры
&НаКлиенте
Процедура Удалить(Команда)
	Маршруты.Удалить(Маршруты.Индекс(Элементы.Маршруты.ТекущиеДанные));
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсех(Команда)
	Маршруты.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВсех(Команда)
	Маршруты.Очистить();
	Объект.ТаблицаМаршрутов.Очистить();
	ДобавитьВсехМаршруты();
КонецПроцедуры

&НаСервере
Процедура ДобавитьВсехМаршруты()
	МТ_Агенты = Справочники.МТ_Маршруты.Выбрать();
	Пока МТ_Агенты.Следующий() Цикл
		Если НЕ МТ_Агенты.ЭтоГруппа и НЕ МТ_Агенты.Агент.Пустая() И НЕ (МТ_Агенты.ПометкаУдаления = Истина) тогда
			НоваяСтрока = Маршруты.Добавить();
			НоваяСтрока.Маршрут = МТ_Агенты.Ссылка;
			НоваяСтрока.Агент = МТ_Агенты.Агент.Ссылка;
			НоваяСтрока.КПККод = МТ_Агенты.Код;	
		КонецЕсли;
	КонецЦикла;  	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если маршруты.Количество()= 0 тогда
		МТ_СистемаКС.отладка("Не выбраны маршруты.", "Клиент")
	Иначе
		СписокМаршрутов = ПолучитьСписокМаршрутов();
		МТ_СистемаСервер.ВыполнитьОбработку(ДатаФормирования, СписокМаршрутов,"0","ПолнВыгр");
	КонецЕсли;
КонецПроцедуры         

&НаСервере
Процедура ПроверкаЗаполнения(ВыбранноеЗначение,СтандартнаяОбработка)
	
	Если ВыбранноеЗначение.Агент.Пустая() Тогда
		МТ_СистемаКС.отладка("У маршрута не задан агнет. Выбрать маршрут невозможно", "Клиент");
		СтандартнаяОбработка = ложь;
	КонецЕсли; 	
КонецПроцедуры // ПроверкаЗаполнения()


&НаКлиенте
Процедура МаршрутыМаршрутОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
ПроверкаЗаполнения(ВыбранноеЗначение,СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	//ФормаВыбора = ПолучитьФорму("Справочник.МТ_Маршруты.ФормаВыбора",, Элементы.Маршруты);
	//ФормаВыбора.Открыть();
	ОткрытьФорму("Справочник.МТ_Маршруты.ФормаВыбора", , Элементы.Маршруты);
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ОбработкаВыбранногоЗначения(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбранногоЗначения(ВыбранноеЗначение)
	МТ_Агенты = ВыбранноеЗначение;
	Если НЕ МТ_Агенты.ЭтоГруппа и НЕ МТ_Агенты.Агент.Пустая() И НЕ (МТ_Агенты.ПометкаУдаления = Истина) тогда
		НоваяСтрока = Маршруты.Добавить();
		НоваяСтрока.Маршрут = МТ_Агенты.Ссылка;
		НоваяСтрока.Агент = МТ_Агенты.Агент.Ссылка;
		НоваяСтрока.КПККод = МТ_Агенты.Код;	
	КонецЕсли;
КонецПроцедуры
	
