&НаКлиенте
Процедура ДобавитьВсех()
	ТаблицаАгентов.Очистить();
	ДобавитьВсехМаршруты();
КонецПроцедуры
Процедура ДобавитьВсехМаршруты()
	//МТ_Агенты = Справочники.МТ_Маршруты.Выбрать();
	//Пока МТ_Агенты.Следующий() Цикл
	//	Если НЕ МТ_Агенты.ЭтоГруппа и НЕ МТ_Агенты.Агент.Пустая() И НЕ (МТ_Агенты.ПометкаУдаления = Истина) тогда
	//		НоваяСтрока = ТаблицаМаршрутов.Добавить();
	//		НоваяСтрока.Маршрут = МТ_Агенты.Ссылка;
	//		НоваяСтрока.Агент = МТ_Агенты.Агент.Ссылка;
	//		НоваяСтрока.КПККод = Формат(МТ_Агенты.Код,"ЧГ=0");	
	//	КонецЕсли;
	//КонецЦикла;
	МТ_Агенты = Справочники.ФизическиеЛица.Выбрать();
	МаршрутыАгентов = Справочники.МТ_МаршрутыАгентов.Выбрать(); 
	Пока МТ_Агенты.Следующий() Цикл
		//Сообщить(МТ_Агенты);
		                                
		Пока МаршрутыАгентов.Следующий() Цикл
			Если НЕ (МТ_Агенты.ПометкаУдаления = Истина) И (МаршрутыАгентов.Агент.Код = МТ_Агенты.Код) Тогда
			    Сообщить("1");	
				НоваяСтрока = ТаблицаАгентов.Добавить();
				//НоваяСтрока.Маршрут = МаршрутыАгентов.
				//Сообщить(НоваяСтрока.Агент.Метаданные()); 
				//Сообщить(МТ_Агенты.Ссылка.Метаданные());
				//Сообщить(МаршрутыАгентов.Ссылка.Метаданные());
				НоваяСтрока.Код = Число(МТ_Агенты.Код);
				НоваяСтрока.Агент = МТ_Агенты.Ссылка;
				Прервать;
				 
			КонецЕсли; 		
		КонецЦикла; 
				
	КонецЦикла; 
КонецПроцедуры
Процедура Добавить()
	СпрАгенты = Справочники.МТ_Маршруты.ПолучитьФормуВыбора(,ЭтаФорма);
	СпрАгенты.ЗакрыватьПриВыборе = Ложь;
	СпрАгенты.ОткрытьМодально();
КонецПроцедуры
Процедура ОбработкаВыбора(ЗначениеВыбора, Источник)
	флаг = 0;
	Если ЗначениеВыбора.ПометкаУдаления = Истина Тогда
		Сообщить("Нельзя выбирать элемент помеченый на удаление!");
		флаг = 1;
	ИначеЕсли ЗначениеВыбора.Этогруппа Тогда
		Сообщить("Это группа!");
		флаг = 1;
	КонецЕсли;
	Если НЕ(СтрДлина(Строка(ТаблицаАгентов.Найти(ЗначениеВыбора.ССылка))) = 0) Тогда
		Сообщить("Агент уже в списке на выгрузку");
		флаг = 1;
	КонецЕсли;
	Если флаг = 0 Тогда
		НоваяСтрока = ТаблицаАгентов.Добавить();
		НоваяСтрока.Агент = ЗначениеВыбора.Агент.Ссылка;
		НоваяСтрока.Маршрут = ЗначениеВыбора.Ссылка;
		НоваяСтрока.КПККод = Формат(ЗначениеВыбора.Код,"ЧГ=0");
	КонецЕсли;
КонецПроцедуры
Процедура Удалить()
	Попытка
		нСтр = ТаблицаАгентов.Найти(ЭлементыФормы.ТабличноеПоле1.ТекущиеДанные.КПККод, "КПККод");
		ТаблицаАгентов.Удалить(нСтр);	
	Исключение
	КонецПопытки;
КонецПроцедуры
Процедура УдалитьВсех()
		ТаблицаАгентов.Очистить();
КонецПроцедуры
Процедура КнопкаВыполнитьНажатие(Кнопка)
	МТ_СистемаСервер.ВыполнитьОбработку(ДатаФорм, ТаблицаАгентов.ВыгрузитьКолонку("Агент"),"0","ПолнВыгр");
КонецПроцедуры

Процедура ИзменитьПуть(Элемент)
	ФК = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ФК.Каталог = СокрЛП(МТ_ПутьКФайлам);
	Если ФК.Выбрать() Тогда
		ПутьКФайлам = ФК.Каталог + "\";
		Константы.МТ_ПутьКФайлам.Установить(МТ_ПутьКФайлам);
	КонецЕсли;
КонецПроцедуры
Процедура ПриОткрытии()
	ДатаФорм = ТекущаяДата();
	МТ_ПутьКФайлам = СокрЛП(Константы.МТ_ПутьКФайлам.Получить());
	флагОбмена = 0;
	Если (СокрЛП(ПараметрЗапуска) = "uploadAll") И (флагОбмена = 0) Тогда
		ДобавитьВсех();
		КнопкаВыполнитьНажатие(1);
		ЗавершитьРаботуСистемы(Ложь);
	Иначе	
		ДобавитьВсех();
	КонецЕсли;
КонецПроцедуры