
Функция ЗагрузитьНастройки()
	НастройкиЗагрузить(ОбъектыВыгрузки, ОбъектыЗагрузки, ЭтаФорма.Заголовок);
КонецФункции

Функция СохранитьНастройки()
	НастройкиСохранить(ОбъектыВыгрузки, ОбъектыЗагрузки);
КонецФункции

Процедура ПриОткрытии()
	ЭлементыФормы.НадписьИмяФайла.Значение = "Файл обработки: "+ИспользуемоеИмяФайла;
	ЗагрузитьНастройки();
	
	ФТПИспользоватьПриИзменении("ПриОткрытии");
	ПроксиИспользоватьПриИзменении("ПриОткрытии");
	КнопкаАвтообменНажатие("ПриОткрытии");
	
	Если ПараметрыСеанса.ТекущийПользователь = АвтообменПользователь Тогда
		Если НЕ АвтообменИспользовать Тогда
			АвтообменИспользовать = Истина;
			КнопкаАвтообменНажатие("ПриОткрытии");
		КонецЕсли;
		// запустить автообмен
		Автообмен();
		//ЭтаФорма.Закрыть();
		//ЗавершитьРаботуСистемы();
		СохранитьНастройки();
		//ПрекратитьРаботуСистемы();
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗакрытии()
	СохранитьНастройки();
КонецПроцедуры


Функция ЭтоПустойСписок(сп)
	Если сп.Количество()=1 Тогда
		Если сп.Получить(0).Значение=ПустоеЗначениеОтбора Тогда
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли сп.Количество()=0 Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции


Процедура ОбъектыВыгрузкиВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	Если Колонка.Имя="Отбор" ИЛИ Колонка.Имя="Исключение" Тогда
		Если ВыбраннаяСтрока.ВидЗначения="" ИЛИ Лев(ВыбраннаяСтрока.ВидЗначения,1)="*" Тогда
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбъектыВыгрузкиОтборНачалоВыбора(Элемент, СтандартнаяОбработка)
	Если ЭтоПустойСписок(Элемент.Значение) Тогда
		Элемент.Значение.Очистить();
		Элемент.Значение.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка."+ЭлементыФормы.ОбъектыВыгрузки.ТекущаяСтрока.ВидЗначения);
	КонецЕсли;
КонецПроцедуры

Процедура ОбъектыВыгрузкиОтборПриИзменении(Элемент)
	Сч = Элемент.Значение.Количество();
	Пока Сч >0 Цикл
		Сч = Сч-1;
		Если НЕ ЗначениеЗаполнено(Элемент.Значение.Получить(Сч).Значение) Тогда
			Элемент.Значение.Удалить(Элемент.Значение.Получить(Сч));	
		КонецЕсли;
	КонецЦикла;
	
	Если Элемент.Значение.Количество()=0 Тогда
		Элемент.Значение.ТипЗначения = Новый ОписаниеТипов("Строка");
		Элемент.Значение.Добавить(ПустоеЗначениеОтбора);
	КонецЕсли;
КонецПроцедуры

Процедура ОбъектыВыгрузкиОтборОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Элемент.Значение.Очистить();
	Элемент.Значение.ТипЗначения = Новый ОписаниеТипов("Строка");
	Элемент.Значение.Добавить(ПустоеЗначениеОтбора);
КонецПроцедуры


Процедура ФТПИспользоватьПриИзменении(Элемент)
	ЭлементыФормы.ФТПСервер.Доступность = ФТПИспользовать;
	ЭлементыФормы.ФТППорт.Доступность = ФТПИспользовать;
	ЭлементыФормы.ФТПТаймаут.Доступность = ФТПИспользовать;
	ЭлементыФормы.ФТППользователь.Доступность = ФТПИспользовать;
	ЭлементыФормы.ФТППароль.Доступность = ФТПИспользовать;
	ЭлементыФормы.КнопкаФТППроверить.Доступность = ФТПИспользовать;
КонецПроцедуры

Процедура ПроксиИспользоватьПриИзменении(Элемент)
	ЭлементыФормы.ПроксиСервер.Доступность = ПроксиИспользовать;
	ЭлементыФормы.ПроксиПорт.Доступность = ПроксиИспользовать;
	ЭлементыФормы.ПроксиПользователь.Доступность = ПроксиИспользовать;
	ЭлементыФормы.ПроксиПароль.Доступность = ПроксиИспользовать;
КонецПроцедуры


Процедура КнопкаКаталогНажатие(Элемент)
	лРежим	= РежимДиалогаВыбораФайла.ВыборКаталога;
	
	ДиалогОткрытияФайла	= Новый ДиалогВыбораФайла(лРежим);
	ДиалогОткрытияФайла.Каталог				= КаталогОбмена;
	ДиалогОткрытияФайла.МножественныйВыбор	= Ложь;
	ДиалогОткрытияФайла.Заголовок			= "Выберите путь к данным";
	
	Если НЕ ДиалогОткрытияФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	КаталогОбмена	= ДиалогОткрытияФайла.Каталог;
	Если НЕ Прав(КаталогОбмена,1)="\" Тогда
		КаталогОбмена = КаталогОбмена+"\";
	КонецЕсли;
	ЗагрузитьНастройки();
КонецПроцедуры

Процедура ПользовательАвтообменаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ПараметрыСеанса.ТекущийПользователь = ВыбранноеЗначение Тогда
		Ответ = Вопрос("Вы действительно хотите назначить пользователем автообмена текущего пользователя?"+Символы.ПС+"Следующий запуск обработки вызовет работу автообмена.", РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет, ,КодВозвратаДиалога.Нет);
		Если НЕ Ответ=КодВозвратаДиалога.Да Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


Процедура КнопкаОбъектыВыгрузитьНажатие(Элемент)
	ВыгрузитьДанные(ОбъектыВыгрузки);
КонецПроцедуры

Процедура КнопкаОбъектыЗагрузитьНажатие(Элемент)
	ЗагрузитьДанные(ОбъектыЗагрузки);
КонецПроцедуры


Процедура Автообмен()
	ЭтаФорма.ЭлементыФормы.НадписьАвтообмен.Заголовок = "Автообмен включен. Последний запуск "+ТекущаяДата();
	КнопкаОбъектыЗагрузитьНажатие("Автообмен");
	КнопкаОбъектыВыгрузитьНажатие("Автообмен");
КонецПроцедуры


Процедура КнопкаОтметкиВыгрузитьУстановитьНажатие(Элемент)
	ОбъектыВыгрузки.ЗаполнитьЗначения(Истина,"Использовать");
КонецПроцедуры

Процедура КнопкаОтметкиВыгрузитьСнятьНажатие(Элемент)
	ОбъектыВыгрузки.ЗаполнитьЗначения(Ложь,"Использовать");
КонецПроцедуры

Процедура КнопкаОтметкиВыгрузитьИнвертироватьНажатие(Элемент)
	Для Каждого стр Из ОбъектыВыгрузки Цикл
		стр.Использовать = НЕ стр.Использовать;
	КонецЦикла;
КонецПроцедуры

Процедура КнопкаОтметкиЗагрузитьУстановитьНажатие(Элемент)
	ОбъектыЗагрузки.ЗаполнитьЗначения(Истина,"Использовать");
КонецПроцедуры

Процедура КнопкаОтметкиЗагрузитьСнятьНажатие(Элемент)
	ОбъектыЗагрузки.ЗаполнитьЗначения(Ложь,"Использовать");
КонецПроцедуры

Процедура КнопкаОтметкиЗагрузитьИнвертироватьНажатие(Элемент)
	Для Каждого стр Из ОбъектыЗагрузки Цикл
		стр.Использовать = НЕ стр.Использовать;
	КонецЦикла;
КонецПроцедуры


Процедура КнопкаАвтообменНажатие(Элемент)
	Если АвтообменИспользовать Тогда
		ЭлементыФормы.КнопкаОбъектыВыгрузить.Доступность = Ложь;
		ЭлементыФормы.КнопкаОбъектыЗагрузить.Доступность = Ложь;
		ЭлементыФормы.АвтообменПериод.Доступность = Ложь;
		ЭлементыФормы.ОбъектыВыгрузки.Колонки.ПоследнийОбмен.Видимость = Истина;
		ЭлементыФормы.ОбъектыЗагрузки.Колонки.ПоследнийОбмен.Видимость = Истина;
		
		ПодключитьОбработчикОжидания("Автообмен", АвтообменПериод);
		ЭлементыФормы.НадписьАвтообмен.Заголовок = "Автообмен включен. "+ТекущаяДата();
	Иначе
		ЭлементыФормы.КнопкаОбъектыВыгрузить.Доступность = Истина;
		ЭлементыФормы.КнопкаОбъектыЗагрузить.Доступность = Истина;
		ЭлементыФормы.АвтообменПериод.Доступность = Истина;
		ЭлементыФормы.ОбъектыВыгрузки.Колонки.ПоследнийОбмен.Видимость = Ложь;
		ЭлементыФормы.ОбъектыЗагрузки.Колонки.ПоследнийОбмен.Видимость = Ложь;
		
		ОтключитьОбработчикОжидания("Автообмен");
		ЭлементыФормы.НадписьАвтообмен.Заголовок = "Автообмен не включен.";
	КонецЕсли;
КонецПроцедуры

Процедура КнопкаФТППроверитьНажатие(Элемент)
	ПроверкаФТП();
КонецПроцедуры

Процедура ОбъектыЗагрузкиПериодичностьПриИзменении(Элемент)
	лПериод = ЭлементыФормы.ОбъектыЗагрузки.ТекущиеДанные.Периодичность;
	Для Каждого стр Из ОбъектыЗагрузки Цикл
		стр.Периодичность = лПериод;
	КонецЦикла;
КонецПроцедуры

Процедура ОбъектыЗагрузкиПриИзмененииФлажка(Элемент, Колонка)
	//лИспользовать = ЭлементыФормы.ОбъектыЗагрузки.ТекущиеДанные.Использовать;
	//Для Каждого стр Из ОбъектыЗагрузки Цикл
	//	стр.Использовать = лИспользовать;
	//КонецЦикла;
КонецПроцедуры


Процедура РедактироватьДопПараметрыПриИзменении(Элемент)
	ЭлементыФормы.ДП01_Описание.Доступность=РедактироватьДопПараметры;
	ЭлементыФормы.ДП01_Значение.Доступность=РедактироватьДопПараметры;
	ЭлементыФормы.ДП02_Описание.Доступность=РедактироватьДопПараметры;
	ЭлементыФормы.ДП02_Значение.Доступность=РедактироватьДопПараметры;
	ЭлементыФормы.ДП03_Описание.Доступность=РедактироватьДопПараметры;
	ЭлементыФормы.ДП03_Значение.Доступность=РедактироватьДопПараметры;
	ЭлементыФормы.ДП04_Описание.Доступность=РедактироватьДопПараметры;
	ЭлементыФормы.ДП04_Значение.Доступность=РедактироватьДопПараметры;
	ЭлементыФормы.ДП05_Описание.Доступность=РедактироватьДопПараметры;
	ЭлементыФормы.ДП05_Значение.Доступность=РедактироватьДопПараметры;
	ЭлементыФормы.ДП06_Описание.Доступность=РедактироватьДопПараметры;
	ЭлементыФормы.ДП06_Значение.Доступность=РедактироватьДопПараметры;
КонецПроцедуры






